IDEA Open Model
MatConcreteEc2.AggregateType Property
Compatible with IDEA StatiCa v 10.1
 Type of aggregate
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public ConcAggregateType AggregateType { get; set; }
Public Property AggregateType As ConcAggregateType
	Get
	Set
public:
property ConcAggregateType AggregateType {
	ConcAggregateType get ();
	void set (ConcAggregateType value);
}
Property Value
Type: ConcAggregateType
See Also
Reference
MatConcreteEc2 Class
IdeaRS.OpenModel.Material Namespace